In [4]:
%LOAD postgresql dbname=Filmes

## Script SQL para a Tarefa 04 - Banco de Dados II 2020.2
## Visões e Índices
### 15/03/2021
### Patric Lacouth - 20191370047

***

### 1. Para a tabela artista, crie uma view artistaV com os seguintes campos: codart, nomeart, datanasc. Renomeie “codart” para “código do artista” e “nomeart” para “nome” na view. Liste o conteúdo da view criada (0,5).

In [7]:
CREATE VIEW artistaV AS
    SELECT codart AS "código do artista",
           nomeart AS "nome",
           datanasc 
           FROM artista;

In [8]:
SELECT * FROM artistaV;

+--------------------+---------------------+---------------------------+
| código do artista | nome                | datanasc                  |
+--------------------+---------------------+---------------------------+
| 1                  | Cameron Diaz        | Tue Jul 15 00:00:00 1975  |
+--------------------+---------------------+---------------------------+
| 2                  | Julia Roberts       | Sat Aug 20 00:00:00 2067  |
+--------------------+---------------------+---------------------------+
| 5                  | Bradley Cooper      | Mon Jun  6 00:00:00 1977  |
+--------------------+---------------------+---------------------------+
| 6                  | Tom Cruise          | Wed Sep 10 00:00:00 2064  |
+--------------------+---------------------+---------------------------+
| 7                  | Rodrigo Santoro     | Thu Oct 12 00:00:00 1978  |
+--------------------+---------------------+---------------------------+
| 8                  | Fulano de Tal       | Thu Jan  1 00:00:00 1970  |
+--------------------+---------------------+---------------------------+
| 3                  | Brad Pitt           | Thu Mar  5 00:00:00 1970  |
+--------------------+---------------------+---------------------------+
| 4                  | Joaquin Phoenix     | Thu Apr  6 00:00:00 1972  |
+--------------------+---------------------+---------------------------+
| 9                  | Rick Martinez       | Wed Aug  8 00:00:00 1888  |
+--------------------+---------------------+---------------------------+
| 11                 | Alessandra Negrini  | Thu Jan  1 00:00:00 1970  |
+--------------------+---------------------+---------------------------+
| 12                 | Fernanda Montenegro | Thu Jan  1 00:00:00 1925  |
+--------------------+---------------------+---------------------------+
11 rows in set (0.01 sec)

***
### 2.Crie uma view filmeV com os seguintes campos: titulo,duração, ano, estúdio (nome do estúdio). Liste, em seguida, seu conteúdo (0,5).

In [14]:
CREATE VIEW filmeV AS
    SELECT f.titulo,f.ano,f.duracao,e.nomeest
        FROM filme f JOIN estudio e ON f.codest = e.codest;

In [16]:
SELECT * FROM filmeV;

+--------------------------+------+---------+-----------+
| titulo                   | ano  | duracao | nomeest   |
+--------------------------+------+---------+-----------+
| Encontro Explosivo       | 2010 | 134     | Paramount |
+--------------------------+------+---------+-----------+
| O Besouro Verde          | 2010 | 155     | Paramount |
+--------------------------+------+---------+-----------+
| Comer, Rezar, Amar       | 2010 | 177     | Paramount |
+--------------------------+------+---------+-----------+
| Coringa                  | 2019 | 122     | Paramount |
+--------------------------+------+---------+-----------+
| Era uma vez em Hollywood | 2020 | 119     | Disney    |
+--------------------------+------+---------+-----------+
| Nasce uma estrela        | 2018 | 100     | Paramount |
+--------------------------+------+---------+-----------+
| PI                       | 1998 | 120     | Paramount |
+--------------------------+------+---------+-----------+
| The Matrix               | 1999 | 130     | Warner    |
+--------------------------+------+---------+-----------+
| Clube da Luta            | 1999 | 140     | Paramount |
+--------------------------+------+---------+-----------+
| Superman                 | 2018 | 120     | Universal |
+--------------------------+------+---------+-----------+
10 rows in set (0,00 sec)

***
## 3.Faça a inserção da artista “Mariana Ximenes” com a data de nascimento ‘27/11/78’ através da view artistaV. Como foi possível inserir por meio da view? Explique (1,0).

In [21]:
INSERT INTO artistaV(nome,datanasc) VALUES('Mariana Ximenes','27/11/78');

In [22]:
select * from artistaV;

+--------------------+---------------------+---------------------------+
| código do artista | nome                | datanasc                  |
+--------------------+---------------------+---------------------------+
| 1                  | Cameron Diaz        | Tue Jul 15 00:00:00 1975  |
+--------------------+---------------------+---------------------------+
| 2                  | Julia Roberts       | Sat Aug 20 00:00:00 2067  |
+--------------------+---------------------+---------------------------+
| 5                  | Bradley Cooper      | Mon Jun  6 00:00:00 1977  |
+--------------------+---------------------+---------------------------+
| 6                  | Tom Cruise          | Wed Sep 10 00:00:00 2064  |
+--------------------+---------------------+---------------------------+
| 7                  | Rodrigo Santoro     | Thu Oct 12 00:00:00 1978  |
+--------------------+---------------------+---------------------------+
| 8                  | Fulano de Tal       | Thu Jan  1 00:00:00 1970  |
+--------------------+---------------------+---------------------------+
| 3                  | Brad Pitt           | Thu Mar  5 00:00:00 1970  |
+--------------------+---------------------+---------------------------+
| 4                  | Joaquin Phoenix     | Thu Apr  6 00:00:00 1972  |
+--------------------+---------------------+---------------------------+
| 9                  | Rick Martinez       | Wed Aug  8 00:00:00 1888  |
+--------------------+---------------------+---------------------------+
| 11                 | Alessandra Negrini  | Thu Jan  1 00:00:00 1970  |
+--------------------+---------------------+---------------------------+
| 12                 | Fernanda Montenegro | Thu Jan  1 00:00:00 1925  |
+--------------------+---------------------+---------------------------+
| 13                 | Mariana Ximenes     | Mon Nov 27 00:00:00 1978  |
+--------------------+---------------------+---------------------------+
12 rows in set (0,00 sec)

***
## 4. Tente inserir um filme através da view filmeV. O que aconteceu? Explique (1,0).

In [24]:
INSERT INTO filmeV(titulo,ano,duracao,nomest) VALUES ('Eu me Importo',2021,150,'Universal');

Error: Cannot execute query. Fatal error. ERROR:  column "nomest" of relation "filmev" does not exist
LINE 1: INSERT INTO filmeV(titulo,ano,duracao,nomest) VALUES ('Eu me...
                                              ^
 while executing "INSERT INTO filmeV(titulo,ano,duracao,nomest) VALUES ('Eu me Importo',2021,150,'Universal');".

In [26]:
INSERT INTO filme(titulo,ano,duracao,codcateg,codest)
       VALUES('Eu me Importo',2021,150,2,3);

In [27]:
SELECT * FROM filmeV;

+--------------------------+------+---------+-----------+
| titulo                   | ano  | duracao | nomeest   |
+--------------------------+------+---------+-----------+
| Encontro Explosivo       | 2010 | 134     | Paramount |
+--------------------------+------+---------+-----------+
| O Besouro Verde          | 2010 | 155     | Paramount |
+--------------------------+------+---------+-----------+
| Comer, Rezar, Amar       | 2010 | 177     | Paramount |
+--------------------------+------+---------+-----------+
| Coringa                  | 2019 | 122     | Paramount |
+--------------------------+------+---------+-----------+
| Era uma vez em Hollywood | 2020 | 119     | Disney    |
+--------------------------+------+---------+-----------+
| Nasce uma estrela        | 2018 | 100     | Paramount |
+--------------------------+------+---------+-----------+
| PI                       | 1998 | 120     | Paramount |
+--------------------------+------+---------+-----------+
| The Matrix               | 1999 | 130     | Warner    |
+--------------------------+------+---------+-----------+
| Clube da Luta            | 1999 | 140     | Paramount |
+--------------------------+------+---------+-----------+
| Superman                 | 2018 | 120     | Universal |
+--------------------------+------+---------+-----------+
| Eu me Importo            | 2021 | 150     | Universal |
+--------------------------+------+---------+-----------+
11 rows in set (0,00 sec)

***
## 5.Crie uma view que apresente os nomes dos artistas dos filmes que são do ano de 2019. Consulte a view criada (1,0).

In [33]:
CREATE VIEW artista_2019 AS
    SELECT a.nomeart 
        FROM artista a JOIN personagem p ON a.codart = p.codart
        JOIN filme f ON p.codfilme = f.codfilme
        WHERE f.ano = 2019;

In [34]:
SELECT * FROM artista_2019;

+-----------------+
| nomeart         |
+-----------------+
| Joaquin Phoenix |
+-----------------+
1 row in set (0,00 sec)

***
## 6.Crie uma view com check option que mostre os artistas cujo nome inicia com ‘B’. Mostre seu nome, código e país. Faça inserções com vários nomes por meio da view e verifique se elas ocorrem (1,0).

In [38]:
CREATE VIEW artista_b AS
    SELECT nomeart, codart, pais FROM artista
        WHERE nomeart LIKE 'B%'
        WITH CHECK OPTION;

In [40]:
SELECT * FROM artista_b;

+----------------+--------+------+
| nomeart        | codart | pais |
+----------------+--------+------+
| Bradley Cooper | 5      | USA  |
+----------------+--------+------+
| Brad Pitt      | 3      | USA  |
+----------------+--------+------+
2 rows in set (0,00 sec)

In [41]:
INSERT INTO artista_b(nomeart,pais)
       VALUES('Brian Cranston','USA');

In [42]:
SELECT * FROM artista_b;

+----------------+--------+------+
| nomeart        | codart | pais |
+----------------+--------+------+
| Bradley Cooper | 5      | USA  |
+----------------+--------+------+
| Brad Pitt      | 3      | USA  |
+----------------+--------+------+
| Brian Cranston | 14     | USA  |
+----------------+--------+------+
3 rows in set (0,00 sec)

In [44]:
INSERT INTO artista_b(nomeart,pais)
       VALUES('Rosamund Pike','USA');

Error: Cannot execute query. Fatal error. ERROR:  new row violates check option for view "artista_b"
DETAIL:  Failing row contains (15, Rosamund Pike, null, USA, null).
 while executing "INSERT INTO artista_b(nomeart,pais)
       VALUES('Rosamund Pike','USA');".

***
# 2ª parte: Índices

In [45]:
%LOAD postgresql dbname=Empregados

***
## 7. Considerando isso, teste o seguinte comando (1,0):
```sql
Explain select * from empregado
where salario > 4000;
```

In [50]:
EXPLAIN SELECT * FROM empregado
    WHERE salario > 4000;

In [49]:
SELECT * FROM empregado
    WHERE salario > 4000;

+-----------+--------------+-----------+---------------------------+----------------------------+---------+---------+----------+
| matricula | primeironome | sobrenome | dataadmissao              | cargo                      | salario | gerente | coddepto |
+-----------+--------------+-----------+---------------------------+----------------------------+---------+---------+----------+
| 2         | José        | Batista   | Mon Mar 15 00:00:00 2021  | Analista de Sistemas Pleno | 4200,   | 1       | 1        |
+-----------+--------------+-----------+---------------------------+----------------------------+---------+---------+----------+
| 4         | Ricardo      | Neves     | Mon Mar 15 00:00:00 2021  | Analista de Sistemas Pleno | 4200,   | 2       | 1        |
+-----------+--------------+-----------+---------------------------+----------------------------+---------+---------+----------+
| 6         | Mariana      | Oliveira  | Mon Mar 15 00:00:00 2021  | Designer de Interface      | 4800,   | 1       | NULL     |
+-----------+--------------+-----------+---------------------------+----------------------------+---------+---------+----------+
3 rows in set (0,00 sec)